# III - Data Analysis

## III.2. Introduction to Pandas üêº

---

<img src="https://www.telestar.fr/var/telestar/storage/images/3/0/7/8/3078328/le-panda-roux-rien-commun-avec-autre-panda-vous-explique-pourquoi.jpg" />

---

Pandas is a Python library made for data manipulation and analysis. Even though it's quite a young library, it has been proven to be very useful for any data scientist!

In [6]:
# First we need to import the library
# By convention we alias (rename) the imported library to `pd` (shorter & more convenient) 
import pandas as pd

# I. Introduction to Pandas

## I.1 Data loading and inspection

The mostly used feature of Pandas is the **`DataFrame`**.

It is a tabular-like structure made of rows and columns.

Let's see an example right now. 

To start things off, we load the `.csv` file, by calling `pd.read_csv` function.

In [7]:
!ls

2-Pandas-Introduction.ipynb class-grades.csv
Stock_Market.csv

In [8]:
# Load data from a CSV file for example
df = pd.read_csv('Stock_Market.csv')

Once the data is loaded, you can do a lot of manipulation on it. You can check the content of the N first lines:

In [10]:
# Now you can have a peek at the first rows
df.head(5)

,Date,Open,High,Low,Close,Volume,Adj Close
0,2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
1,2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2,2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
3,2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
4,2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

As well as the N last lines:

In [11]:
df.tail(8)

,Date,Open,High,Low,Close,Volume,Adj Close
1981,2008-08-19,11478.089844,11478.169922,11318.500000,11348.549805,171580000,11348.549805
1982,2008-08-18,11659.650391,11690.429688,11434.120117,11479.389648,156290000,11479.389648
1983,2008-08-15,11611.209961,11709.889648,11599.730469,11659.900391,215040000,11659.900391
1984,2008-08-14,11532.070312,11718.280273,11450.889648,11615.929688,159790000,11615.929688
1985,2008-08-13,11632.809570,11633.780273,11453.339844,11532.959961,182550000,11532.959961
1986,2008-08-12,11781.700195,11782.349609,11601.519531,11642.469727,173590000,11642.469727
1987,2008-08-11,11729.669922,11867.110352,11675.530273,11782.349609,183190000,11782.349609
1988,2008-08-08,11432.089844,11759.959961,11388.040039,11734.320312,212830000,11734.320312

In a Pandas DataFrame, rows are labeled by what we call the **index** (in bold on the left side).

You will see the index is a very powerful attribute of the DataFrame - especially when you want to select a subset of lines (slicing)

We can retrieve this index using `index` attribute.

In [13]:
# You can retrieve the index like this
df.index

RangeIndex(start=0, stop=1989, step=1)

Sometimes, it can be useful to specify a given column as the **index** when loading the data. To do so, you need to specify the index of the column you want to use as the index.

In [14]:
# We select the first column (index 0) as the index of our DataFrame
df = pd.read_csv('Stock_Market.csv', index_col=0)
df.head()

,Open,High,Low,Close,Volume,Adj Close
Date,,,,,,
2016-07-01,17924.240234,18002.380859,17916.910156,17949.369141,82160000,17949.369141
2016-06-30,17712.759766,17930.609375,17711.800781,17929.990234,133030000,17929.990234
2016-06-29,17456.019531,17704.509766,17456.019531,17694.679688,106380000,17694.679688
2016-06-28,17190.509766,17409.720703,17190.509766,17409.720703,112190000,17409.720703
2016-06-27,17355.210938,17355.210938,17063.080078,17140.240234,138740000,17140.240234

You can get a summary of some metadata about each column using `info` method. It outputs:
- number of non-null entries per column
- dtypes of columns
- memory usage

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1989 entries, 2016-07-01 to 2008-08-08
Data columns (total 6 columns):
Open         1989 non-null float64
High         1989 non-null float64
Low          1989 non-null float64
Close        1989 non-null float64
Volume       1989 non-null int64
Adj Close    1989 non-null float64
dtypes: float64(5), int64(1)
memory usage: 108.8+ KB

As well as some basic statistics of your dataset with `describe` method. This outputs:
- number of non-null entries
- mean
- standard deviation
- min and max values
- interquartile values
per columns containing countinuous variables

In [15]:
# You can also get some statistics
df.describe()

,Open,High,Low,Close,Volume,Adj Close
count,1989.000000,1989.000000,1989.000000,1989.000000,1.989000e+03,1989.000000
mean,13459.116048,13541.303173,13372.931728,13463.032255,1.628110e+08,13463.032255
std,3143.281634,3136.271725,3150.420934,3144.006996,9.392343e+07,3144.006996
min,6547.009766,6709.609863,6469.950195,6547.049805,8.410000e+06,6547.049805
25%,10907.339844,11000.980469,10824.759766,10913.379883,1.000000e+08,10913.379883
50%,13022.049805,13088.110352,12953.129883,13025.580078,1.351700e+08,13025.580078
75%,16477.699219,16550.070312,16392.769531,16478.410156,1.926000e+08,16478.410156
max,18315.060547,18351.359375,18272.560547,18312.390625,6.749200e+08,18312.390625

Always useful: the shape! Outputs a tuple containing (n_rows, n_columns)

> ‚ö†Ô∏è **Warning**: `shape` is an attribute (not a method) of the DataFrame so no need to add parenthesis

In [17]:
# The good old shape is still here
df.shape

(1989, 6)

You can also get the columns and indices values:

In [27]:
# You can also retrieve the columns (as an Index object)
df.columns

Index(['Open', 'High', 'Low', 'Close', 'Volume', 'Adj Close'], dtype='object')

In [28]:
# `df.columns` returns the columns as an Index object
# If you want to retrieve the columns names as a list you can do:
df.columns.tolist()

['Open', 'High', 'Low', 'Close', 'Volume', 'Adj Close']

In [20]:
# Again, we can retrieve the index
df.index

Index(['2016-07-01', '2016-06-30', '2016-06-29', '2016-06-28', '2016-06-27',
       '2016-06-24', '2016-06-23', '2016-06-22', '2016-06-21', '2016-06-20',
       ...
       '2008-08-21', '2008-08-20', '2008-08-19', '2008-08-18', '2008-08-15',
       '2008-08-14', '2008-08-13', '2008-08-12', '2008-08-11', '2008-08-08'],
      dtype='object', name='Date', length=1989)

As you can see (`dtype='object'`), Pandas did not automatically understand the Date column was of type `date`.

We can fix that by applying the function `pd.to_datetime` to our DataFrame Index.:

In [29]:
# Let's convert the strings to dates in our Index
df.index = pd.to_datetime(df.index)
df.index

DatetimeIndex(['2016-07-01', '2016-06-30', '2016-06-29', '2016-06-28',
               '2016-06-27', '2016-06-24', '2016-06-23', '2016-06-22',
               '2016-06-21', '2016-06-20',
               ...
               '2008-08-21', '2008-08-20', '2008-08-19', '2008-08-18',
               '2008-08-15', '2008-08-14', '2008-08-13', '2008-08-12',
               '2008-08-11', '2008-08-08'],
              dtype='datetime64[ns]', name='Date', length=1989, freq=None)

Now, `dtype='datetime64[ns]'`. Sounds better!

## I.2 Data Statistics

Let's see how we can retrieve some statistics about the data. What if I want the mean value of the Open?

In [30]:
# mean value
print('mean:',df['Open'].mean())
# min and max values
print('min and max values:', df['Open'].min(), df['Open'].max())

mean: 13459.116048413774
min and max values: 6547.009765999999 18315.060547

But I can also get the number of unique values of a column (even though not really relevant here):

In [31]:
df['Open'].nunique()

1980

I can get the unique values, and how much rows there are for each value:

In [32]:
# The unique values are the following:
df['Open'].unique()

array([17924.240234, 17712.759766, 17456.019531, ..., 11781.700195,
       11729.669922, 11432.089844])

Also pretty useful, we can count the number of observations per unique value in a column using `values_counts` method

In [35]:
# The number of rows for each value is the following
df['Open'].value_counts()

17374.779297    2
18033.330078    2
10309.389648    2
17711.119141    2
17812.250000    2
12221.190430    2
12266.750000    2
10780.000000    2
9868.339844     2
17910.019531    1
15332.709961    1
16512.380859    1
14911.599609    1
17987.380859    1
13577.849609    1
11392.009766    1
18038.300781    1
14756.780273    1
17664.990234    1
15630.639648    1
14801.549805    1
10402.429688    1
9732.530273     1
11478.089844    1
9961.519531     1
14995.459961    1
11396.169922    1
15170.700195    1
12864.650391    1
7659.810059     1
               ..
9706.679688     1
12151.190430    1
8826.889648     1
10409.980469    1
10680.160156    1
11896.280273    1
11363.849609    1
10560.129883    1
15168.099609    1
16009.450195    1
17892.029297    1
10398.589844    1
9285.049805     1
12055.519531    1
11560.480469    1
16109.929688    1
18072.580078    1
9062.330078     1
18072.470703    1
12229.219727    1
12104.559570    1
17110.390625    1
8446.009766     1
11137.629883    1
8299.250000     1
14673.459961    1
12101.080078    1
12339.709961    1
12293.469727    1
16505.039062    1
Name: Open, Length: 1980, dtype: int64

This is particularly useful for categorical variables!

# II. DataFrame manipulation

We will see now how to make data manipuation using Pandas!

## II.1 Columns and indices handling

First if you want to select a column, access it using brackets: `df["column_name"]`

In [21]:
df['Open'].head()

Date
2016-07-01    17924.240234
2016-06-30    17712.759766
2016-06-29    17456.019531
2016-06-28    17190.509766
2016-06-27    17355.210938
Name: Open, dtype: float64

Let's check what type is a column:

In [23]:
# Okay what type is that ?
type(df['Open'])

pandas.core.series.Series

Okay basically, in Pandas' world, a table is a **DataFrame** object, and a column is a **Series** object.

But you can also retrieve your column as a good old Numpy array.

In [24]:
# Now we have a Series, what if we want a good old numpy array?
# Just ask for the values
df['Open'].values

array([17924.240234, 17712.759766, 17456.019531, ..., 11781.700195,
       11729.669922, 11432.089844])

Let's check the type to be sure:

In [36]:
type(df['Open'].values)

numpy.ndarray

Cool, we are back on our feet! Now what if we want several columns at the same time?

Remember, one column is a Series and several columns (a table basically) is a DataFrame.

As it happens, using `df['column_name_1', 'column_name_2]` will not work, because you are trying to retrieve **several columns** inside **one Series object**.

Instead, we can do `df[['column_name_1', 'column_name_2]]` (with **double brackets**) which will return a new **DataFrame**.

In [40]:
# Now what if several columns are needed?
df[['Open', 'Close']].tail()

                    Open         Close
Date
2008-08-14  11532.070312  11615.929688
2008-08-13  11632.809570  11532.959961
2008-08-12  11781.700195  11642.469727
2008-08-11  11729.669922  11782.349609
2008-08-08  11432.089844  11734.320312

Since a DataFrame is like a tabular, you might to use indices to **slice** your data (filter rows and/or columns).

To do that, you need to use the method `iloc`

In [41]:
# You can slice using indices by using iloc:
df.iloc[-5:,0:2]

                    Open          High
Date
2008-08-14  11532.070312  11718.280273
2008-08-13  11632.809570  11633.780273
2008-08-12  11781.700195  11782.349609
2008-08-11  11729.669922  11867.110352
2008-08-08  11432.089844  11759.959961

See? `iloc` works as a regular table, so you won't be much surprised.

If you want to use the key and not the index, the proper method is *loc*:

In [42]:
# If you prefer to use the keys, then you need to use loc:
df.loc[:'2015/12/31', ['High','Low']]

                    High           Low
Date
2016-07-01  18002.380859  17916.910156
2016-06-30  17930.609375  17711.800781
2016-06-29  17704.509766  17456.019531
2016-06-28  17409.720703  17190.509766
2016-06-27  17355.210938  17063.080078
2016-06-24  17946.630859  17356.339844
2016-06-23  18011.070312  17844.109375
2016-06-22  17920.160156  17770.359375
2016-06-21  17877.839844  17799.800781
2016-06-20  17946.359375  17736.869141
2016-06-17  17733.439453  17602.779297
2016-06-16  17754.910156  17471.289062
2016-06-15  17762.960938  17629.009766
2016-06-14  17733.919922  17595.789062
2016-06-13  17893.279297  17731.349609
2016-06-10  17938.820312  17812.339844
2016-06-09  18005.220703  17915.880859
2016-06-08  18016.000000  17931.910156
2016-06-07  18003.230469  17936.220703
2016-06-06  17949.679688  17822.810547
2016-06-03  17833.169922  17689.679688
2016-06-02  17838.560547  17703.550781
2016-06-01  17809.179688  17664.789062
2016-05-31  17899.240234  17724.029297
2016-05-27  17873.220703  17824.730469
2016-05-26  17888.660156  17803.820312
2016-05-25  17891.710938  17735.089844
2016-05-24  17742.589844  17525.189453
2016-05-23  17550.699219  17480.050781
2016-05-20  17571.750000  17437.320312
...                  ...           ...
2016-02-12  15974.040039  15691.620117
2016-02-11  15897.820312  15503.009766
2016-02-10  16201.889648  15899.910156
2016-02-09  16136.620117  15881.110352
2016-02-08  16147.509766  15803.549805
2016-02-05  16423.630859  16129.809570
2016-02-04  16485.839844  16266.160156
2016-02-03  16381.690430  15960.450195
2016-02-02  16420.210938  16108.440430
2016-02-01  16510.980469  16299.469727
2016-01-29  16466.300781  16090.259766
2016-01-28  16102.139648  15863.719727
2016-01-27  16235.030273  15878.299805
2016-01-26  16185.790039  15893.160156
2016-01-25  16086.459961  15880.150391
2016-01-22  16136.790039  15921.099609
2016-01-21  16038.589844  15704.660156
2016-01-20  15989.450195  15450.559570
2016-01-19  16171.959961  15900.250000
2016-01-15  16354.330078  15842.110352
2016-01-14  16482.050781  16075.120117
2016-01-13  16593.509766  16123.200195
2016-01-12  16591.349609  16322.070312
2016-01-11  16461.849609  16232.030273
2016-01-08  16651.890625  16314.570312
2016-01-07  16888.359375  16463.630859
2016-01-06  17154.830078  16817.619141
2016-01-05  17195.839844  17038.609375
2016-01-04  17405.480469  16957.630859
2015-12-31  17590.660156  17421.160156

[127 rows x 2 columns]

Finally, you can also use conditions and booleans. Let's see how to do that if we want low volume days:

In [40]:
# Booleans can also be used, and thus conditions of variables
# Let's try to get only the low volume days (Volume < 5e+7)
low_volume_days = df['Volume'] < 5e+7
low_volume_days.value_counts()

False    1981
True        8
Name: Volume, dtype: int64

Now that we have made a boolean, let's use it:

In [41]:
# Let's display the 8 low volume days
low_volume_df = df.loc[low_volume_days]
low_volume_df

,Open,High,Low,Close,Volume,Adj Close
Date,,,,,,
2015-12-24,17593.259766,17606.339844,17543.949219,17552.169922,40350000,17552.169922
2014-12-30,18035.019531,18035.019531,17959.699219,17983.070312,47490000,17983.070312
2014-12-24,18035.730469,18086.240234,18027.779297,18030.210938,42870000,18030.210938
2013-12-27,16486.369141,16529.009766,16461.230469,16478.410156,47230000,16478.410156
2013-12-24,16295.700195,16360.599609,16295.700195,16357.549805,33640000,16357.549805
2012-12-24,13190.150391,13190.379883,13128.549805,13138.929688,47710000,13138.929688
2011-12-29,12152.320312,12293.959961,12152.089844,12287.040039,8410000,12287.040039
2011-11-15,12077.919922,12165.110352,12001.259766,12096.160156,14510000,12096.160156

That's it, here are our 8 low volume days information!

## II.2 How to create your own dataframe?

Now we are (almost) expert in dataframe handling, but let's see how to create your own! You can do that using a dictionary for example:

In [50]:
# Well you can do it using a dictionary
redhot = {
    'name' : ['anthony', 'michael', 'chad', 'josh'],
    'instrument' : ['voice', 'bass', 'drums', 'guitar'],
    'birth' : [1962, 1962, 1961, 1979]
}
# Then create your dataframe
my_df = pd.DataFrame(redhot)
my_df

      name instrument  birth
0  anthony      voice   1962
1  michael       bass   1962
2     chad      drums   1961
3     josh     guitar   1979

Let's use the name as index:

In [51]:
my_df.index = my_df['name']
my_df

            name instrument  birth
name
anthony  anthony      voice   1962
michael  michael       bass   1962
chad        chad      drums   1961
josh        josh     guitar   1979

It was not the smartest way of doing it, we have the names twice. No panic, let's remove a column:

In [52]:
# Well now we have the name twice, let's fix this by removing a column
my_df = my_df.drop(['name'], axis=1)
my_df

        instrument  birth
name
anthony      voice   1962
michael       bass   1962
chad         drums   1961
josh        guitar   1979

A row can be removed the same way:

In [53]:
# We can drop a row easily too
my_df = my_df.drop(['josh','chad'], axis=0)
my_df

        instrument  birth
name
anthony      voice   1962
michael       bass   1962

Finally, one can add a column easily:

In [54]:
# It's quite easy to add a column too
my_df['original_band'] = True
my_df

        instrument  birth  original_band
name
anthony      voice   1962           True
michael       bass   1962           True

## II.3 Data preparation

Now we know how to create and handle dataframes, but why is it so helpful for data scientists? Well, let's see how it can be helpful to handle missing value on a new dataset:

In [90]:
# Let's import a new dataset
new_df = pd.read_csv('class-grades.csv')
new_df.head(10)

   Prefix  Assignment  Tutorial  Midterm TakeHome  Final
0       5       57.14     34.09    64.38    51.48   52.5
1       8       95.05    105.49    67.50    99.07  68.33
2       8       83.70     83.17    30.00    63.15  48.89
3       7       81.22     96.06    49.38   105.93  80.56
4       8       91.32     93.64    95.00   107.41  73.89
5       7       95.00     92.58    93.12    97.78  68.06
6       8       95.05    102.99    56.25    99.07     50
7       7       72.85     86.85    60.00        ?  56.11
8       8       84.26     93.10    47.50    18.52  50.83
9       7       90.10     97.55    51.25    88.89  63.61

Okay we have some '?', what shows info?

In [91]:
# Well it seems alright, let's check deeper
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 6 columns):
Prefix        99 non-null int64
Assignment    99 non-null float64
Tutorial      99 non-null float64
Midterm       99 non-null float64
TakeHome      99 non-null object
Final         99 non-null object
dtypes: float64(3), int64(1), object(2)
memory usage: 4.7+ KB

We can fix this using the following command to replace '?' by NaN:

In [92]:
new_df = pd.read_csv('class-grades.csv', na_values=['?'])
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 6 columns):
Prefix        99 non-null int64
Assignment    99 non-null float64
Tutorial      99 non-null float64
Midterm       99 non-null float64
TakeHome      98 non-null float64
Final         96 non-null float64
dtypes: float64(5), int64(1)
memory usage: 4.7 KB

Okay now *info* works better! Always have a look at the data!

So there are NaN in our table. We can choose to remove them for example:

In [93]:
# Well we have some NaN in our data
# A naive approach would be to remove them
drop_df = new_df.dropna()
drop_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 95 entries, 0 to 98
Data columns (total 6 columns):
Prefix        95 non-null int64
Assignment    95 non-null float64
Tutorial      95 non-null float64
Midterm       95 non-null float64
TakeHome      95 non-null float64
Final         95 non-null float64
dtypes: float64(5), int64(1)
memory usage: 5.2 KB

Done, no NaN anymore. But could we do something smarter? What if the removed data was helpful? Let's replace them by the mean value:

In [60]:
new_df['Final'] = new_df['Final'].fillna(new_df['Final'].dropna().mean())
new_df['TakeHome'] = new_df['TakeHome'].fillna(new_df['TakeHome'].dropna().mean())
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 6 columns):
Prefix        99 non-null int64
Assignment    99 non-null float64
Tutorial      99 non-null float64
Midterm       99 non-null float64
TakeHome      99 non-null float64
Final         99 non-null float64
dtypes: float64(5), int64(1)
memory usage: 4.7 KB

## II.4 Merging and concatenation

Finally, let's check how to merge and concatenate datafarmes. Let's first create two series:

In [62]:
# Let's create two series
s1 = pd.Series(['apple', 'orange', 'banana'], index=[1, 2, 4])
s2 = pd.Series(['pineapple', 'wildberry', 'raspberry'], index=[3, 2, 6])

print(s1)
print(s2)

1     apple
2    orange
4    banana
dtype: object
3    pineapple
2    wildberry
6    raspberry
dtype: object

And let's try to concatenate them:

In [63]:
# What if we concatenate them?
pd.concat([s1, s2])

1        apple
2       orange
4       banana
3    pineapple
2    wildberry
6    raspberry
dtype: object

Okay that worked, but you see the indices are not necessarily ordered, so be careful when you concatenate!

Another example using merge:

In [68]:
# Another example
meal = ['pizza', 'pasta', 'burger']
prices = [11.8, 12.9, 15.60]
calories = [870, 790, 950]
prices = pd.DataFrame({'meal': meal, 'prices': prices})
calories = pd.DataFrame(calories, index=meal, columns=['calories'])

In [69]:
prices

     meal  prices
0   pizza    11.8
1   pasta    12.9
2  burger    15.6

In [70]:
calories

        calories
pizza        870
pasta        790
burger       950

In [71]:
# We can merge them in a smart way:
prices.merge(calories, left_on='meal', right_index=True)

     meal  prices  calories
0   pizza    11.8       870
1   pasta    12.9       790
2  burger    15.6       950